# ============================================================================
# Homebrew Taps
# ============================================================================
tap 'homebrew/bundle'
tap 'jandedobbeleer/oh-my-posh'

if OS.linux?
   tap 'gromgit/fuse'
end

# ============================================================================
# Applications (Casks)
# ============================================================================

# --- Browsers ---
cask 'firefox'
cask 'google-chrome'

# --- Terminals ---
cask 'ghostty'

# --- Fonts ---
cask 'font-fira-code-nerd-font'
cask 'font-commit-mono-nerd-font'

# --- macOS Utilities ---
if OS.mac?
    cask 'alfred'              # Productivity launcher
    cask 'karabiner-elements'  # Keyboard customization
    cask 'steam'               # Gaming
end

# --- Utilities ---
cask 'qlmarkdown'              # Quick Look markdown preview
cask 'vlc'                     # Media player

# ============================================================================
# Command Line Tools
# ============================================================================

# --- Shell & Terminal ---
brew 'zsh'                     # Modern shell
brew 'zsh-vi-mode'             # Vi mode for zsh
brew 'atuin'                   # Enhanced shell history
brew 'fzf'                     # Fuzzy finder
brew 'oh-my-posh'              # Prompt theme engine

# --- Core Utilities ---
brew 'coreutils'               # GNU core utilities
brew 'findutils'               # GNU find, xargs, locate
brew 'moreutils'               # Additional Unix tools
brew 'automake'                # Build tool
brew 'openssl'                 # SSL/TLS toolkit
brew 'readline'                # Command line editing

# --- File & Text Tools ---
brew 'bat'                     # Cat with syntax highlighting
brew 'eza'                     # Modern ls replacement
brew 'fd'                      # Modern find replacement
brew 'ripgrep'                 # Fast grep replacement
brew 'tree'                    # Directory tree viewer
brew 'rename'                  # Perl rename utility
brew 'highlight'               # Syntax highlighter

# --- Git & Version Control ---
brew 'git'                     # Version control
brew 'git-delta'               # Better git diff
brew 'git-extras'              # Git utilities
brew 'gh'                      # GitHub CLI
brew 'jesseduffield/lazygit/lazygit'  # Git TUI
brew 'spaceman-diff'           # Image diffs for git

# --- Development Tools ---
brew 'neovim'                  # Modern vim
brew 'ctags'                   # Code navigation
brew 'python3'                 # Python interpreter
brew 'ranger'                  # Terminal file manager
brew 'bottom'                  # System monitor

# --- Media & Documentation ---
brew 'ffmpeg'                  # Video processing
brew 'imagemagick'             # Image processing
brew 'lame'                    # MP3 encoder
brew 'pngpaste'                # Paste images from clipboard
brew 'podofo'                  # PDF toolkit
brew 'mermaid-cli'             # Diagram generation
brew 'tidy-html5'              # HTML tidy tool

# --- Utilities ---
brew 'wget'                    # File downloader
