tap 'homebrew/bundle'
tap 'jandedobbeleer/oh-my-posh'

if OS.linux?
   tap 'gromgit/fuse'
end

cask 'firefox'
cask 'font-fira-code-nerd-font'
cask 'font-commit-mono-nerd-font'
cask 'ghostty'
cask 'google-chrome'
if OS.mac?
    cask 'alfred'
    cask 'karabiner-elements'
    cask 'steam'
end
cask 'qlmarkdown'
cask 'vlc'

brew 'atuin'
brew 'automake'
brew 'bat'
brew 'bottom'
brew 'coreutils'
brew 'ctags'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'highlight'
brew 'imagemagick'
brew 'jesseduffield/lazygit/lazygit'
brew 'lame'
brew 'neovim'
brew 'oh-my-posh'
brew 'openssl'
brew 'pngpaste'
brew 'podofo'
brew 'python3'
brew 'ranger'
brew 'readline'
brew 'rename'
brew 'ripgrep'
brew 'spaceman-diff'
brew 'tidy-html5'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-vi-mode'
